#+title:      second-preimage
#+date:       [2025-11-12 mié 16:00]
#+filetags:   :cripto:diplomatura:famaf:
#+identifier: 20251112T160028

** Solución



#+begin_src python :results output :session cripto
from hashlib import sha256

target = b'alvarmaciel@gmail.com'
print(sha256(target).hexdigest()[:6])
expected = sha256(target).hexdigest()[:6]
message = b''
for i in range(0, (2**32)-1):
     test = target+i.to_bytes(4, 'big')
     if sha256(test).hexdigest()[:6] == expected:
         message = test    
         break
print(message)
print(sha256(message).hexdigest()[:6])
with open('message.bin', 'wb') as f:
    f.write(message)

#+end_src

#+RESULTS:
: 7ae248
: b'alvarmaciel@gmail.com\x00\x18\xf5b'
: 7ae248

#+begin_src python :results output :session cripto
import requests
url = 'https://ciberseguridad.diplomatura.unc.edu.ar/cripto/second-preimage/alvarmaciel@gmail.com/answer'
data = {'message': message}
print(message)
response = requests.post(url, files=data)
print(response.status_code)
print(response.text)
#+end_src

#+RESULTS:
: b'alvarmaciel@gmail.com\x00\x18\xf5b'
: 200
: ¡Ganaste!


** Solución
#+begin_src python :results output :session collision
from hashlib import sha256
email = b"alvarmaciel@gmail.com"
checked = {}
messages = []
for i in range(2**25):
    message = email + i.to_bytes(4, 'big')
    hash_48 = sha256(message).hexdigest()[:12]
    if hash_48 in checked:
        messages = [checked.get(hash_48), message]
        break
    else:
        checked[hash_48]= message
print(f"Iteraciones completadas: {i}")
print(f"Hashes únicos guardados: {len(checked)}")
print(f"¿Se encontró colisión?: {len(messages) > 0}")
m1, m2 = messages
h1 = sha256(m1).hexdigest()[:12]
h2 = sha256(m2).hexdigest()[:12]
print(f"M1: {m1}")
print(f"M2: {m2}")
print(f"Hash M1: {h1}")
print(f"Hash M2: {h2}")
print(f"¿Son iguales?: {h1 == h2}")
print(f"¿Mensajes diferentes?: {m1 != m2}")
#+end_src

#+RESULTS:
: Iteraciones completadas: 8992364
: Hashes únicos guardados: 8992364
: ¿Se encontró colisión?: True
: M1: b'alvarmaciel@gmail.com\x00^\xc7\xfb'
: M2: b'alvarmaciel@gmail.com\x00\x896l'
: Hash M1: ec8221e55a2c
: Hash M2: ec8221e55a2c
: ¿Son iguales?: True
: ¿Mensajes diferentes?: True

#+begin_src python :results output :session collision
import requests
url = 'https://ciberseguridad.diplomatura.unc.edu.ar/cripto/collision/alvarmaciel@gmail.com/answer'
data = {'message1': m1, 'message2':m2}
print(data)
response = requests.post(url, files=data)
print(response.status_code)
print(response.text)
#+end_src

#+RESULTS:
: {'message1': b'alvarmaciel@gmail.com\x00^\xc7\xfb', 'message2': b'alvarmaciel@gmail.com\x00\x896l'}
: 200
: ¡Ganaste!

